_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 400)               80400     
_________________________________________________________________
dense_1 (Dense)              (None, 200)               80200     
_________________________________________________________________
dense_2 (Dense)              (None, 50)                10050     
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 51        
=================================================================
Total params: 170,701
Trainable params: 170,701
Non-trainable params: 0
_________________________________________________________________
validation accuracy : 0.734472049689441
sizes of layers : [400, 200, 50, 1]
epochs : 30
batch size : 64
number of features : 200
