_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 20)                220       
_________________________________________________________________
dense_1 (Dense)              (None, 20)                420       
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 21        
=================================================================
Total params: 661
Trainable params: 661
Non-trainable params: 0
_________________________________________________________________
validation accuracy : 0.6413043478260869
sizes of layers : [20, 20, 1]
epochs : 30
batch size : 64
number of features : 10
