_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 20)                3020      
_________________________________________________________________
dense_1 (Dense)              (None, 20)                420       
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 21        
=================================================================
Total params: 3,461
Trainable params: 3,461
Non-trainable params: 0
_________________________________________________________________
validation accuracy : 0.7127329192546584
sizes of layers : [20, 20, 1]
epochs : 15
batch size : 64
number of features : 150
